; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	thermograph1 - mode
	spectrograph3 - mode
	infrared0 - mode
	Star3 - direction
	GroundStation7 - direction
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	Star0 - direction
	Star4 - direction
	Star1 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument5 spectrograph3)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star5)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star6)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument10 spectrograph3)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 Star0)
	(supports instrument11 infrared0)
	(supports instrument11 thermograph1)
	(supports instrument11 spectrograph3)
	(calibration_target instrument11 Star1)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 Planet11)
	(pointing satellite4 Star12)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph2)
	(have_image Star12 infrared0)
	(have_image Star13 infrared0)
	(have_image Star14 thermograph1)
))

)

; plan
1. (turn_to satellite4 star0 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 star0)
   goals met: 0 of 10
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite4 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite4 star13 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 star13)
   goals met: 0 of 10
5. (take_image satellite4 star13 instrument7 infrared0)
   added: (have_image star13 infrared0)
   goals met: 1 of 10
6. (turn_to satellite4 star10 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star10)
   goals met: 1 of 10
7. (take_image satellite4 star10 instrument7 infrared0)
   added: (have_image star10 infrared0)
   goals met: 2 of 10
8. (turn_to satellite4 planet11 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet11)
   goals met: 2 of 10
9. (take_image satellite4 planet11 instrument7 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 3 of 10
10. (turn_to satellite4 phenomenon9 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 10
11. (turn_to satellite0 star4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star4)
   goals met: 4 of 10
12. (take_image satellite4 phenomenon9 instrument7 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 5 of 10
13. (turn_to satellite1 planet11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet11)
   goals met: 6 of 10
14. (turn_to satellite4 star14 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star14)
   goals met: 6 of 10
15. (take_image satellite4 star14 instrument7 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 7 of 10
16. (turn_to satellite4 star8 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star8)
   goals met: 7 of 10
17. (take_image satellite4 star8 instrument7 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 8 of 10
18. (turn_to satellite4 star12 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 star12)
   goals met: 9 of 10
19. (take_image satellite4 star12 instrument7 infrared0)
   added: (have_image star12 infrared0)
   goals met: 10 of 10
